GopalSaraf/Practicals/PSDL/include/proc/pic18f46j13.inc
// Register: PCL
#define PCL PCL
PCL                                      equ 0FF9h
// bitfield definitions
PCL_PCL_POSN                             equ 0000h
PCL_PCL_POSITION                         equ 0000h
PCL_PCL_SIZE                             equ 0008h
PCL_PCL_LENGTH                           equ 0008h
PCL_PCL_MASK                             equ 00FFh

// Register: PCLATH
#define PCLATH PCLATH
PCLATH                                   equ 0FFAh
// bitfield definitions
PCLATH_PCH_POSN                          equ 0000h
PCLATH_PCH_POSITION                      equ 0000h
PCLATH_PCH_SIZE                          equ 0008h
PCLATH_PCH_LENGTH                        equ 0008h
PCLATH_PCH_MASK                          equ 00FFh

// Register: PCLATU
#define PCLATU PCLATU
PCLATU                                   equ 0FFBh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FFCh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh
STKPTR_STKUNF_POSN                       equ 0006h
STKPTR_STKUNF_POSITION                   equ 0006h
STKPTR_STKUNF_SIZE                       equ 0001h
STKPTR_STKUNF_LENGTH                     equ 0001h
STKPTR_STKUNF_MASK                       equ 0040h
STKPTR_STKFUL_POSN                       equ 0007h
STKPTR_STKFUL_POSITION                   equ 0007h
STKPTR_STKFUL_SIZE                       equ 0001h
STKPTR_STKFUL_LENGTH                     equ 0001h
STKPTR_STKFUL_MASK                       equ 0080h
STKPTR_SP0_POSN                          equ 0000h
STKPTR_SP0_POSITION                      equ 0000h
STKPTR_SP0_SIZE                          equ 0001h
STKPTR_SP0_LENGTH                        equ 0001h
STKPTR_SP0_MASK                          equ 0001h
STKPTR_SP1_POSN                          equ 0001h
STKPTR_SP1_POSITION                      equ 0001h
STKPTR_SP1_SIZE                          equ 0001h
STKPTR_SP1_LENGTH                        equ 0001h
STKPTR_SP1_MASK                          equ 0002h
STKPTR_SP2_POSN                          equ 0002h
STKPTR_SP2_POSITION                      equ 0002h
STKPTR_SP2_SIZE                          equ 0001h
STKPTR_SP2_LENGTH                        equ 0001h
STKPTR_SP2_MASK                          equ 0004h
STKPTR_SP3_POSN                          equ 0003h
STKPTR_SP3_POSITION                      equ 0003h
STKPTR_SP3_SIZE                          equ 0001h
STKPTR_SP3_LENGTH                        equ 0001h
STKPTR_SP3_MASK                          equ 0008h
STKPTR_SP4_POSN                          equ 0004h
STKPTR_SP4_POSITION                      equ 0004h
STKPTR_SP4_SIZE                          equ 0001h
STKPTR_SP4_LENGTH                        equ 0001h
STKPTR_SP4_MASK                          equ 0010h
STKPTR_STKOVF_POSN                       equ 0007h
STKPTR_STKOVF_POSITION                   equ 0007h
STKPTR_STKOVF_SIZE                       equ 0001h
STKPTR_STKOVF_LENGTH                     equ 0001h
STKPTR_STKOVF_MASK                       equ 0080h

// Register: TOS
#define TOS TOS
TOS                                      equ 0FFDh

// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 0FFDh
// bitfield definitions
TOSL_TOSL_POSN                           equ 0000h
TOSL_TOSL_POSITION                       equ 0000h
TOSL_TOSL_SIZE                           equ 0008h
TOSL_TOSL_LENGTH                         equ 0008h
TOSL_TOSL_MASK                           equ 00FFh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 0FFEh
// bitfield definitions
TOSH_TOSH_POSN                           equ 0000h
TOSH_TOSH_POSITION                       equ 0000h
TOSH_TOSH_SIZE                           equ 0008h
TOSH_TOSH_LENGTH                         equ 0008h
TOSH_TOSH_MASK                           equ 00FFh

// Register: TOSU
#define TOSU TOSU
TOSU                                     equ 0FFFh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 0FFFFFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 0FFh)
#endif
#define ABDEN1                           BANKMASK(BAUDCON1), 0, a
#define ABDEN2                           BANKMASK(BAUDCON2), 0, a
#define ABDOVF1                          BANKMASK(BAUDCON1), 7, a
#define ABDOVF2                          BANKMASK(BAUDCON2), 7, a
#define ACKDT1                           BANKMASK(SSP1CON2), 5, a
#define ACKDT2                           BANKMASK(SSP2CON2), 5, a
#define ACKEN1                           BANKMASK(SSP1CON2), 4, a
#define ACKEN2                           BANKMASK(SSP2CON2), 4, a
#define ACKSTAT1                         BANKMASK(SSP1CON2), 6, a
#define ACKSTAT2                         BANKMASK(SSP2CON2), 6, a
#define ACQT0                            BANKMASK(ADCON1), 3, a
#define ACQT1                            BANKMASK(ADCON1), 4, a
#define ACQT2                            BANKMASK(ADCON1), 5, a
#define ADCAL                            BANKMASK(ADCON1), 6, a
#define ADCMD                            BANKMASK(PMDIS0), 0, b
#define ADCS0                            BANKMASK(ADCON1), 0, a
#define ADCS1                            BANKMASK(ADCON1), 1, a
#define ADCS2                            BANKMASK(ADCON1), 2, a
#define ADDEN1                           BANKMASK(RCSTA1), 3, a
#define ADDEN2                           BANKMASK(RCSTA2), 3, a
#define ADEN                             BANKMASK(RCSTA1), 3, a
#define ADFM                             BANKMASK(ADCON1), 7, a
#define ADIE                             BANKMASK(PIE1), 6, a
#define ADIF                             BANKMASK(PIR1), 6, a
#define ADIP                             BANKMASK(IPR1), 6, a
#define ADMSK11                          BANKMASK(SSP1CON2), 1, a
#define ADMSK12                          BANKMASK(SSP2CON2), 1, a
#define ADMSK21                          BANKMASK(SSP1CON2), 2, a
#define ADMSK22                          BANKMASK(SSP2CON2), 2, a
#define ADMSK31                          BANKMASK(SSP1CON2), 3, a
#define ADMSK32                          BANKMASK(SSP2CON2), 3, a
#define ADMSK41                          BANKMASK(SSP1CON2), 4, a
#define ADMSK42                          BANKMASK(SSP2CON2), 4, a
#define ADMSK51                          BANKMASK(SSP1CON2), 5, a
#define ADMSK52                          BANKMASK(SSP2CON2), 5, a
#define ADON                             BANKMASK(ADCON0), 0, a
#define ADRMUX0                          BANKMASK(PMCONH), 3, b
#define ADRMUX1                          BANKMASK(PMCONH), 4, b
#define ALP                              BANKMASK(PMCONL), 5, b
#define ALRMEN                           BANKMASK(ALRMCFG), 7, b
#define ALRMPTR0                         BANKMASK(ALRMCFG), 0, b
#define ALRMPTR1                         BANKMASK(ALRMCFG), 1, b
#define AMASK0                           BANKMASK(ALRMCFG), 2, b
#define AMASK1                           BANKMASK(ALRMCFG), 3, b
#define AMASK2                           BANKMASK(ALRMCFG), 4, b
#define AMASK3                           BANKMASK(ALRMCFG), 5, b
#define AN0                              BANKMASK(PORTA), 0, a
#define AN1                              BANKMASK(PORTA), 1, a
#define AN10                             BANKMASK(PORTB), 1, a
#define AN11                             BANKMASK(PORTC), 2, a
#define AN12                             BANKMASK(PORTB), 0, a
#define AN2                              BANKMASK(PORTA), 2, a
#define AN3                              BANKMASK(PORTA), 3, a
#define AN4                              BANKMASK(PORTA), 5, a
#define AN5                              BANKMASK(PORTE), 0, a
#define AN6                              BANKMASK(PORTE), 1, a
#define AN7                              BANKMASK(PORTE), 2, a
#define AN8                              BANKMASK(PORTB), 2, a
#define AN9                              BANKMASK(PORTB), 3, a
#define ARPT0                            BANKMASK(ALRMRPT), 0, b
#define ARPT1                            BANKMASK(ALRMRPT), 1, b
#define ARPT2                            BANKMASK(ALRMRPT), 2, b
#define ARPT3                            BANKMASK(ALRMRPT), 3, b
#define ARPT4                            BANKMASK(ALRMRPT), 4, b
#define ARPT5                            BANKMASK(ALRMRPT), 5, b
#define ARPT6                            BANKMASK(ALRMRPT), 6, b
#define ARPT7                            BANKMASK(ALRMRPT), 7, b
#define BCL1IE                           BANKMASK(PIE2), 3, a
#define BCL1IF                           BANKMASK(PIR2), 3, a
#define BCL1IP                           BANKMASK(IPR2), 3, a
#define BCL2IE                           BANKMASK(PIE3), 6, a
#define BCL2IF                           BANKMASK(PIR3), 6, a
#define BCL2IP                           BANKMASK(IPR3), 6, a
#define BCLIE                            BANKMASK(PIE2), 3, a
#define BCLIF                            BANKMASK(PIR2), 3, a
#define BCLIP                            BANKMASK(IPR2), 3, a
#define BEP                              BANKMASK(PMCONL), 2, b
#define BF1                              BANKMASK(SSP1STAT), 0, a
#define BF2                              BANKMASK(SSP2STAT), 0, a
#define BGVST                            BANKMASK(HLVDCON), 6, a
#define BOR                              BANKMASK(RCON), 0, a
#define BRG161                           BANKMASK(BAUDCON1), 3, a
#define BRG162                           BANKMASK(BAUDCON2), 3, a
#define BRGH1                            BANKMASK(TXSTA1), 2, a
#define BRGH2                            BANKMASK(TXSTA2), 2, a
#define BUSY                             BANKMASK(PMMODEH), 7, b
#define C10TSEL0                         BANKMASK(CCPTMRS2), 4, b
#define C1CH0                            BANKMASK(CM1CON), 0, a
#define C1CH1                            BANKMASK(CM1CON), 1, a
#define C1INA                            BANKMASK(PORTA), 0, a
#define C1INB                            BANKMASK(PORTA), 3, a
#define C1INC                            BANKMASK(PORTA), 5, a
#define C1IND                            BANKMASK(PORTA), 2, a
#define C1TSEL0                          BANKMASK(CCPTMRS0), 0, b
#define C1TSEL1                          BANKMASK(CCPTMRS0), 1, b
#define C1TSEL2                          BANKMASK(CCPTMRS0), 2, b
#define C2INA                            BANKMASK(PORTA), 1, a
#define C2INB                            BANKMASK(PORTA), 2, a
#define C2INC                            BANKMASK(PORTB), 2, a
#define C2IND                            BANKMASK(PORTC), 2, a
#define C2TSEL0                          BANKMASK(CCPTMRS0), 3, b
#define C2TSEL1                          BANKMASK(CCPTMRS0), 4, b
#define C2TSEL2                          BANKMASK(CCPTMRS0), 5, b
#define C3INA                            BANKMASK(PORTB), 3, a
#define C3INB                            BANKMASK(PORTA), 2, a
#define C3INC                            BANKMASK(PORTB), 1, a
#define C3IND                            BANKMASK(PORTB), 0, a
#define C3TSEL0                          BANKMASK(CCPTMRS0), 6, b
#define C3TSEL1                          BANKMASK(CCPTMRS0), 7, b
#define C4TSEL0                          BANKMASK(CCPTMRS1), 0, b
#define C4TSEL1                          BANKMASK(CCPTMRS1), 1, b
#define C5TSEL0                          BANKMASK(CCPTMRS1), 2, b
#define C6TSEL0                          BANKMASK(CCPTMRS1), 4, b
#define C7TSEL0                          BANKMASK(CCPTMRS1), 6, b
#define C7TSEL1                          BANKMASK(CCPTMRS1), 7, b
#define C8TSEL0                          BANKMASK(CCPTMRS2), 0, b
#define C8TSEL1                          BANKMASK(CCPTMRS2), 1, b
#define C9TSEL0                          BANKMASK(CCPTMRS2), 2, b
#define CAL0                             BANKMASK(RTCCAL), 0, b
#define CAL1                             BANKMASK(RTCCAL), 1, b
#define CAL2                             BANKMASK(RTCCAL), 2, b
#define CAL3                             BANKMASK(RTCCAL), 3, b
#define CAL4                             BANKMASK(RTCCAL), 4, b
#define CAL5                             BANKMASK(RTCCAL), 5, b
#define CAL6                             BANKMASK(RTCCAL), 6, b
#define CAL7                             BANKMASK(RTCCAL), 7, b
#define CARRY                            BANKMASK(STATUS), 0, a
#define CCH01                            BANKMASK(CM1CON), 0, a
#define CCH02                            BANKMASK(CM2CON), 0, a
#define CCH03                            BANKMASK(CM3CON), 0, b
#define CCH05                            BANKMASK(IPR5), 0, a
#define CCH11                            BANKMASK(CM1CON), 1, a
#define CCH12                            BANKMASK(CM2CON), 1, a
#define CCH13                            BANKMASK(CM3CON), 1, b
#define CCH15                            BANKMASK(IPR5), 1, a
#define CCIP3IP                          BANKMASK(IPR4), 0, a
#define CCP10                            BANKMASK(PORTC), 7, a
#define CCP10IE                          BANKMASK(PIE4), 7, a
#define CCP10IF                          BANKMASK(PIR4), 7, a
#define CCP10IP                          BANKMASK(IPR4), 7, a
#define CCP10M0                          BANKMASK(CCP10CON), 0, b
#define CCP10M1                          BANKMASK(CCP10CON), 1, b
#define CCP10M2                          BANKMASK(CCP10CON), 2, b
#define CCP10M3                          BANKMASK(CCP10CON), 3, b
#define CCP10MD                          BANKMASK(PMDIS3), 7, b
#define CCP10OD                          BANKMASK(ODCON2), 3, b
#define CCP1IE                           BANKMASK(PIE1), 2, a
#define CCP1IF                           BANKMASK(PIR1), 2, a
#define CCP1IP                           BANKMASK(IPR1), 2, a
#define CCP1M0                           BANKMASK(CCP1CON), 0, a
#define CCP1M1                           BANKMASK(CCP1CON), 1, a
#define CCP1M2                           BANKMASK(CCP1CON), 2, a
#define CCP1M3                           BANKMASK(CCP1CON), 3, a
#define CCP1X                            BANKMASK(CCP1CON), 5, a
#define CCP1Y                            BANKMASK(CCP1CON), 4, a
#define CCP2                             BANKMASK(PORTC), 1, a
#define CCP2IE                           BANKMASK(PIE2), 0, a
#define CCP2IF                           BANKMASK(PIR2), 0, a
#define CCP2IP                           BANKMASK(IPR2), 0, a
#define CCP2M0                           BANKMASK(CCP2CON), 0, a
#define CCP2M1                           BANKMASK(CCP2CON), 1, a
#define CCP2M2                           BANKMASK(CCP2CON), 2, a
#define CCP2M3                           BANKMASK(CCP2CON), 3, a
#define CCP2X                            BANKMASK(CCP2CON), 5, a
#define CCP2Y                            BANKMASK(CCP2CON), 4, a
#define CCP2_PA2                         BANKMASK(PORTB), 3, a
#define CCP3IE                           BANKMASK(PIE4), 0, a
#define CCP3IF                           BANKMASK(PIR4), 0, a
#define CCP3IP                           BANKMASK(IPR4), 0, a
#define CCP3M0                           BANKMASK(CCP3CON), 0, b
#define CCP3M1                           BANKMASK(CCP3CON), 1, b
#define CCP3M2                           BANKMASK(CCP3CON), 2, b
#define CCP3M3                           BANKMASK(CCP3CON), 3, b
#define CCP4                             BANKMASK(PORTB), 4, a
#define CCP4IE                           BANKMASK(PIE4), 1, a
#define CCP4IF                           BANKMASK(PIR4), 1, a
#define CCP4IP                           BANKMASK(IPR4), 1, a
#define CCP4M0                           BANKMASK(CCP4CON), 0, b
#define CCP4M1                           BANKMASK(CCP4CON), 1, b
#define CCP4M2                           BANKMASK(CCP4CON), 2, b
#define CCP4M3                           BANKMASK(CCP4CON), 3, b
#define CCP4MD                           BANKMASK(PMDIS3), 1, b
#define CCP4OD                           BANKMASK(ODCON1), 3, b
#define CCP5                             BANKMASK(PORTB), 5, a
#define CCP5IE                           BANKMASK(PIE4), 2, a
#define CCP5IF                           BANKMASK(PIR4), 2, a
#define CCP5IP                           BANKMASK(IPR4), 2, a
#define CCP5M0                           BANKMASK(CCP5CON), 0, b
#define CCP5M1                           BANKMASK(CCP5CON), 1, b
#define CCP5M2                           BANKMASK(CCP5CON), 2, b
#define CCP5M3                           BANKMASK(CCP5CON), 3, b
#define CCP5MD                           BANKMASK(PMDIS3), 2, b
#define CCP5OD                           BANKMASK(ODCON1), 4, b
#define CCP6                             BANKMASK(PORTB), 6, a
#define CCP6IE                           BANKMASK(PIE4), 3, a
#define CCP6IF                           BANKMASK(PIR4), 3, a
#define CCP6IP                           BANKMASK(IPR4), 3, a
#define CCP6M0                           BANKMASK(CCP6CON), 0, b
#define CCP6M1                           BANKMASK(CCP6CON), 1, b
#define CCP6M2                           BANKMASK(CCP6CON), 2, b
#define CCP6M3                           BANKMASK(CCP6CON), 3, b
#define CCP6MD                           BANKMASK(PMDIS3), 3, b
#define CCP6OD                           BANKMASK(ODCON1), 5, b
#define CCP7                             BANKMASK(PORTB), 7, a
#define CCP7IE                           BANKMASK(PIE4), 4, a
#define CCP7IF                           BANKMASK(PIR4), 4, a
#define CCP7IP                           BANKMASK(IPR4), 4, a
#define CCP7M0                           BANKMASK(CCP7CON), 0, b
#define CCP7M1                           BANKMASK(CCP7CON), 1, b
#define CCP7M2                           BANKMASK(CCP7CON), 2, b
#define CCP7M3                           BANKMASK(CCP7CON), 3, b
#define CCP7MD                           BANKMASK(PMDIS3), 4, b
#define CCP7OD                           BANKMASK(ODCON1), 6, b
#define CCP8                             BANKMASK(PORTC), 1, a
#define CCP8IE                           BANKMASK(PIE4), 5, a
#define CCP8IF                           BANKMASK(PIR4), 5, a
#define CCP8IP                           BANKMASK(IPR4), 5, a
#define CCP8M0                           BANKMASK(CCP8CON), 0, b
#define CCP8M1                           BANKMASK(CCP8CON), 1, b
#define CCP8M2                           BANKMASK(CCP8CON), 2, b
#define CCP8M3                           BANKMASK(CCP8CON), 3, b
#define CCP8MD                           BANKMASK(PMDIS3), 5, b
#define CCP8OD                           BANKMASK(ODCON1), 7, b
#define CCP9                             BANKMASK(PORTC), 6, a
#define CCP9IE                           BANKMASK(PIE4), 6, a
#define CCP9IF                           BANKMASK(PIR4), 6, a
#define CCP9IP                           BANKMASK(IPR4), 6, a
#define CCP9M0                           BANKMASK(CCP9CON), 0, b
#define CCP9M1                           BANKMASK(CCP9CON), 1, b
#define CCP9M2                           BANKMASK(CCP9CON), 2, b
#define CCP9M3                           BANKMASK(CCP9CON), 3, b
#define CCP9MD                           BANKMASK(PMDIS3), 6, b
#define CCP9OD                           BANKMASK(ODCON2), 2, b
#define CHIME                            BANKMASK(ALRMCFG), 6, b
#define CHS0                             BANKMASK(ADCON0), 2, a
#define CHS1                             BANKMASK(ADCON0), 3, a
#define CHS2                             BANKMASK(ADCON0), 4, a
#define CHS3                             BANKMASK(ADCON0), 5, a
#define CHSN3                            BANKMASK(ADCON1), 3, a
#define CK1                              BANKMASK(PORTC), 6, a
#define CKE1                             BANKMASK(SSP1STAT), 6, a
#define CKE2                             BANKMASK(SSP2STAT), 6, a
#define CKP1                             BANKMASK(SSP1CON1), 4, a
#define CKP2                             BANKMASK(SSP2CON1), 4, a
#define CKTXP                            BANKMASK(BAUDCON1), 4, a
#define CLKI                             BANKMASK(PORTA), 7, a
#define CLKO                             BANKMASK(PORTA), 6, a
#define CM                               BANKMASK(RCON), 5, a
#define CM1IE                            BANKMASK(PIE2), 5, a
#define CM1IF                            BANKMASK(PIR2), 5, a
#define CM1IP                            BANKMASK(IPR2), 5, a
#define CM2IE                            BANKMASK(PIE2), 6, a
#define CM2IF                            BANKMASK(PIR2), 6, a
#define CM2IP                            BANKMASK(IPR2), 6, a
#define CM3IE                            BANKMASK(PIE5), 5, a
#define CM3IF                            BANKMASK(PIR5), 5, a
#define CM3IP                            BANKMASK(IPR5), 5, a
#define CMIE                             BANKMASK(PIE2), 6, a
#define CMIF                             BANKMASK(PIR2), 6, a
#define CMIP                             BANKMASK(IPR2), 6, a
#define CMP1MD                           BANKMASK(PMDIS2), 0, b
#define CMP2MD                           BANKMASK(PMDIS2), 1, b
#define CMP3MD                           BANKMASK(PMDIS2), 2, b
#define CMPL02                           BANKMASK(PSTR2CON), 6, a
#define CMPL03                           BANKMASK(PSTR3CON), 6, b
#define CMPL12                           BANKMASK(PSTR2CON), 7, a
#define CMPL13                           BANKMASK(PSTR3CON), 7, b
#define COE1                             BANKMASK(CM1CON), 6, a
#define COE2                             BANKMASK(CM2CON), 6, a
#define COE3                             BANKMASK(CM3CON), 6, b
#define CON1                             BANKMASK(CM1CON), 7, a
#define CON2                             BANKMASK(CM2CON), 7, a
#define CON3                             BANKMASK(CM3CON), 7, b
#define COUT1                            BANKMASK(CMSTAT), 0, a
#define COUT2                            BANKMASK(CMSTAT), 1, a
#define COUT3                            BANKMASK(CMSTAT), 2, a
#define CPOL1                            BANKMASK(CM1CON), 5, a
#define CPOL2                            BANKMASK(CM2CON), 5, a
#define CPOL3                            BANKMASK(CM3CON), 5, b
#define CREF1                            BANKMASK(CM1CON), 2, a
#define CREF2                            BANKMASK(CM2CON), 2, a
#define CREF3                            BANKMASK(CM3CON), 2, b
#define CREN1                            BANKMASK(RCSTA1), 4, a
#define CREN2                            BANKMASK(RCSTA2), 4, a
#define CS                               BANKMASK(PORTE), 2, a
#define CS1                              BANKMASK(PMADDRH), 6, a
#define CS1P                             BANKMASK(PMCONL), 3, b
#define CSF0                             BANKMASK(PMCONL), 6, b
#define CSF1                             BANKMASK(PMCONL), 7, b
#define CSRC1                            BANKMASK(TXSTA1), 7, a
#define CSRC2                            BANKMASK(TXSTA2), 7, a
#define CTED1                            BANKMASK(PORTB), 2, a
#define CTED2                            BANKMASK(PORTB), 3, a
#define CTMUDS                           BANKMASK(ODCON3), 7, b
#define CTMUEN                           BANKMASK(CTMUCONH), 7, a
#define CTMUIE                           BANKMASK(PIE3), 2, a
#define CTMUIF                           BANKMASK(PIR3), 2, a
#define CTMUIP                           BANKMASK(IPR3), 2, a
#define CTMUMD                           BANKMASK(PMDIS1), 6, b
#define CTMUSIDL                         BANKMASK(CTMUCONH), 5, a
#define CTPLS                            BANKMASK(PORTC), 2, a
#define CTTRIG                           BANKMASK(CTMUCONH), 0, a
#define CVR0                             BANKMASK(CVRCON), 0, b
#define CVR1                             BANKMASK(CVRCON), 1, b
#define CVR2                             BANKMASK(CVRCON), 2, b
#define CVR3                             BANKMASK(CVRCON), 3, b
#define CVREF                            BANKMASK(PORTA), 2, a
